nathanfraske/CEC-Platform/firmware/esp/proto/pcie-8pin-2port/sdkconfig.defaults
# CEC PCIe 8-pin 2-port — sdkconfig defaults (ESP32-S3-MINI-1 N4R2)
#
# Regenerate sdkconfig with: idf.py set-target esp32s3 (rm sdkconfig to re-apply).

CONFIG_IDF_TARGET="esp32s3"

# 4 MB flash, 2 MB QUAD PSRAM (MINI-1-N4R2).
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# OTA partition layout + CAN-OTA rollback safety.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_ESP_WIFI_ENABLED=n
CONFIG_BT_ENABLED=n

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_CEC_TELEMETRY_UART0=n

# CAN (TWAI) to the Hub via the RJ-45 CAN pair (TJA1051T/3). TX/RX are
# PLACEHOLDERS (IO17/IO18) -- VERIFY against the pcie-8pin-2port schematic
# (the v3.10 spec puts the C6 CAN on IO20/21; the as-built board is S3).
CONFIG_CEC_CAN_TX_GPIO=17
CONFIG_CEC_CAN_RX_GPIO=18
CONFIG_CEC_CAN_BITRATE_BPS=125000
